/*
 * Copyright 2013 Freescale Semiconductor, Inc. All Rights Reserved.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307 USA
 *
 */

#ifndef __ARCH_ARM_D4400_CCM_REGS_H__
#define __ARCH_ARM_D4400_CCM_REGS_H__

struct d4400_ccm_reg {
	u32 cscsr;	/* 0x00 */
	u32 ccsr;
	u32 ccdr1;
	u32 ccdr2;
	u32 ccdr3;	/* 0x10 */
	u32 ccgcr1;
	u32 ccgcr2;
	u32 pcgcr;
	u32 spgcr;	/* 0x20 */
	u32 spgsr;
	u32 lpcgr0;
	u32 lpcgr1;
	u32 lpcgr2;	/* 0x30 */
	u32 lpcgr3;
	u32 lpcgr4;
	u32 lpcgr5;
	u32 lpcgr6;	/* 0x40 */
	u32 lpcgr7;
	u32 lpcgr8;
	u32 lpcgr9;
	u32 lpcgr10;	/* 0x50 */
	u32 lpcgr11;
	u32 lpcgr12;
	u32 lpcgr13;
	u32 lpcgr14;	/* 0x60 */
	u32 lpcgr15;
	u32 lpcgr16;
	u32 lpcgr17;
	u32 lpcgr18;	/* 0x70 */
	u32 mora;
	u32 morb;
	u32 morc;
	u32 mord;	/* 0x80 */
	u32 more;
	u32 morf;
	u32 cpor;
	u32 ckor;	/* 0x90 */
	u32 cmcr;
	u32 cmcr2;
	u32 vpgcsr;
	u32 vpgcmr;	/* 0xA0 */
	u32 fiur1;
	u32 fiur2;
	u32 cgpr;
	u32 resv1[28];
	u32 spllgsr;	/* 0x120 */
	u32 resv2[3];
	u32 splllksr;
	u32 resv3[11];
	u32 dpllgsr;
	u32 resv4[3];
	u32 dplllksr;
	u32 resv5[11];
	u32 tpllgsr;	/* 0x1A0 */
	u32 resv6[3];
	u32 tplllksr;
	u32 resv7[27];
	u32 spllgdcr;
	u32 resv8[3];
	u32 splllkdcr;
	u32 resv9[11];
	u32 dpllgdcr;
	u32 resv10[3];
	u32 dplllkdcr;	/* 0x270 */
	u32 resv11[11];
	u32 tpllgdcr;
	u32 resv12[3];
	u32 tplllkdcr;
};

/* CCM-CSCSR */
#define D4400_CCM_CSCSR_UART1_SEL_OFFSET	0
#define D4400_CCM_CSCSR_UART1_MASK	(1<<D4400_CCM_CSCSR_UART1_SEL_OFFSET)
#define D4400_CCM_CSCSR_UART2_SEL_OFFSET	1
#define D4400_CCM_CSCSR_UART2_MASK	(1<<D4400_CCM_CSCSR_UART2_SEL_OFFSET)
#define D4400_CCM_CSCSR_UART3_SEL_OFFSET	2
#define D4400_CCM_CSCSR_UART3_MASK	(1<<D4400_CCM_CSCSR_UART3_SEL_OFFSET)
#define D4400_CCM_CSCSR_UART4_SEL_OFFSET	3
#define D4400_CCM_CSCSR_UART4_MASK	(1<<D4400_CCM_CSCSR_UART4_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI1_SEL_OFFSET	8
#define D4400_CCM_CSCSR_ECSPI1_MASK	(1<<D4400_CCM_CSCSR_ECSPI1_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI2_SEL_OFFSET	9
#define D4400_CCM_CSCSR_ECSPI2_MASK	(1<<D4400_CCM_CSCSR_ECSPI2_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI3_SEL_OFFSET	10
#define D4400_CCM_CSCSR_ECSPI3_MASK	(1<<D4400_CCM_CSCSR_ECSPI3_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI4_SEL_OFFSET	11
#define D4400_CCM_CSCSR_ECSPI4_MASK	(1<<D4400_CCM_CSCSR_ECSPI4_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI5_SEL_OFFSET	12
#define D4400_CCM_CSCSR_ECSPI5_MASK	(1<<D4400_CCM_CSCSR_ECSPI5_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI6_SEL_OFFSET	13
#define D4400_CCM_CSCSR_ECSPI6_MASK	(1<<D4400_CCM_CSCSR_ECSPI6_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI7_SEL_OFFSET	14
#define D4400_CCM_CSCSR_ECSPI7_MASK	(1<<D4400_CCM_CSCSR_ECSPI7_SEL_OFFSET)
#define D4400_CCM_CSCSR_ECSPI8_SEL_OFFSET	15
#define D4400_CCM_CSCSR_ECSPI8_MASK	(1<<D4400_CCM_CSCSR_ECSPI8_SEL_OFFSET)
#define D4400_CCM_CSCSR_MMDC_SEL_OFFSET	16
#define D4400_CCM_CSCSR_MMDC_MASK	(3<<D4400_CCM_CSCSR_MMDC_SEL_OFFSET)
#define D4400_CCM_CSCSR_VSPA_DP_SEL_OFFSET	18
#define D4400_CCM_CSCSR_VSPA_DP_MASK	(3<<D4400_CCM_CSCSR_VSPA_DP_SEL_OFFSET)
#define D4400_CCM_CSCSR_ETSEC_RTC_SEL_OFFSET	27
#define D4400_CCM_CSCSR_ETSEC_RTC_MASK\
			(1<<D4400_CCM_CSCSR_ETSEC_RTC_SEL_OFFSET)
#define D4400_CCM_CSCSR_TPIU_CLK_SEL_OFFSET	28
#define D4400_CCM_CSCSR_TPIU_CLK_MASK\
			(1<<D4400_CCM_CSCSR_TPIU_CLK_SEL_OFFSET)
#define D4400_CCM_CSCSR_TRACE_SEL_OFFSET		29
#define D4400_CCM_CSCSR_TRACE_MASK	(3<<D4400_CCM_CSCSR_TRACE_SEL_OFFSET)
#define D4400_CCM_CSCSR_WEIM_SEL_OFFSET		31
#define D4400_CCM_CSCSR_WEIM_MASK	(1<<D4400_CCM_CSCSR_WEIM_SEL_OFFSET)

/* CCM-CCSR */
#define D4400_CCM_CCSR_SCS_OFFSET		0
#define D4400_CCM_CCSR_SCS_MASK		(0x1<<D4400_CCM_CCSR_SCS_OFFSET)
#define D4400_CCM_CCSR_SYS_REF_SEL_OFFSET	4
#define D4400_CCM_CCSR_SYS_REF_SEL_MASK	(0x1<<D4400_CCM_CCSR_SYS_REF_SEL_OFFSET)
#define D4400_CCM_CCSR_SMD_OFFSET		18
#define D4400_CCM_CCSR_SMD_MASK		(0x1<<D4400_CCM_CCSR_SMD_OFFSET)
#define D4400_CCM_CCSR_ACC_QSPI_OFFSET	27
#define D4400_CCM_CCSR_ACC_QSPI_MASK	(0x1<<D4400_CCM_CCSR_ACC_QSPI_OFFSET)
#define D4400_CCM_CCSR_CLK_BYPASS_OFFSET	28
#define D4400_CCM_CCSR_CLK_BYPASS_MASK	(0x1<<D4400_CCM_CCSR_CLK_BYPASS_OFFSET)
#define D4400_CCM_CCSR_DDR_BYP_OFFSET	29
#define D4400_CCM_CCSR_DDR_BYP_MASK	(0x1<<D4400_CCM_CCSR_DDR_BYP_OFFSET)
#define D4400_CCM_CCSR_ACC_BYP_OFFSET	30
#define D4400_CCM_CCSR_ACC_BYP_MASK	(0x1<<D4400_CCM_CCSR_ACC_BYP_OFFSET)
#define D4400_CCM_CCSR_BYP_SYS_OFFSET	31
#define D4400_CCM_CCSR_BYP_SYS_MASK	(0x1<<D4400_CCM_CCSR_BYP_SYS_OFFSET)

/* CCM-CCDR1 */
#define D4400_CCM_CCDR1_ARM_DIV_OFFSET	0
#define D4400_CCM_CCDR1_ARM_DIV_MASK	(0x3<<D4400_CCM_CCDR1_ARM_DIV_OFFSET)
#define D4400_CCM_CCDR1_VSPA_DIV_OFFSET	4
#define D4400_CCM_CCDR1_VSPA_DIV_MASK	(0x3<<D4400_CCM_CCDR1_VSPA_DIV_OFFSET)
#define D4400_CCM_CCDR1_AXII_DIV_OFFSET	8
#define D4400_CCM_CCDR1_AXII_DIV_MASK	(0x3<<D4400_CCM_CCDR1_AXII_DIV_OFFSET)
#define D4400_CCM_CCDR1_AHB_DIV_OFFSET	12
#define D4400_CCM_CCDR1_AHB_DIV_MASK	(0x3<<D4400_CCM_CCDR1_AHB_DIV_OFFSET)
#define D4400_CCM_CCDR1_IP_DIV_OFFSET	14
#define D4400_CCM_CCDR1_IP_DIV_MASK	(0x3<<D4400_CCM_CCDR1_IP_DIV_OFFSET)
#define D4400_CCM_CCDR1_VSPA_DP_DIV_OFFSET 16
#define D4400_CCM_CCDR1_VSPA_DP_DIV_MASK \
				(0x3<<D4400_CCM_CCDR1_VSPA_DP_DIV_OFFSET)
#define D4400_CCM_CCDR1_GPC_DIV_OFFSET	18
#define D4400_CCM_CCDR1_GPC_DIV_MASK	(0x3<<D4400_CCM_CCDR1_GPC_DIV_OFFSET)
#define D4400_CCM_CCDR1_WEIM_DIV_OFFSET	20
#define D4400_CCM_CCDR1_WEIM_DIV_MASK	(0xF<<D4400_CCM_CCDR1_WEIM_DIV_OFFSET)
#define D4400_CCM_CCDR1_PLL_SYS_DIV_OFFSET	24
#define D4400_CCM_CCDR1_PLL_SYS_DIV_MASK \
			(0xF<<D4400_CCM_CCDR1_PLL_SYS_DIV_OFFSET)
#define D4400_CCM_CCDR1_MMDC_DIV_OFFSET	28
#define D4400_CCM_CCDR1_MMDC_DIV_MASK	(0xF<<D4400_CCM_CCDR1_MMDC_DIV_OFFSET)

/* CCM-CCDR2 */
#define D4400_CCM_CCDR2_UART1_DIV_OFFSET	0
#define D4400_CCM_CCDR2_UART1_DIV_MASK	(0xF<<D4400_CCM_CCDR2_UART1_DIV_OFFSET)
#define D4400_CCM_CCDR2_UART2_DIV_OFFSET	4
#define D4400_CCM_CCDR2_UART2_DIV_MASK	(0xF<<D4400_CCM_CCDR2_UART2_DIV_OFFSET)
#define D4400_CCM_CCDR2_UART3_DIV_OFFSET	8
#define D4400_CCM_CCDR2_UART3_DIV_MASK	(0xF<<D4400_CCM_CCDR2_UART3_DIV_OFFSET)
#define D4400_CCM_CCDR2_UART4_DIV_OFFSET	12
#define D4400_CCM_CCDR2_UART4_DIV_MASK	(0xF<<D4400_CCM_CCDR2_UART4_DIV_OFFSET)
#define D4400_CCM_CCDR2_REV_CLK_DIV_OFFSET	16
#define D4400_CCM_CCDR2_REV_CLK_DIV_MASK (3<<D4400_CCM_CCDR2_REV_CLK_DIV_OFFSET)
#define D4400_CCM_CCDR2_REV_CLK_SEL_OFFSET	18
#define D4400_CCM_CCDR2_REV_CLK_SEL_MASK (1<<D4400_CCM_CCDR2_REV_CLK_SEL_OFFSET)
#define D4400_CCM_CCDR2_SGMII_PHY_CLK_OFFSET	20
#define D4400_CCM_CCDR2_SGMII_PHY_CLK_MASK \
	(7<<D4400_CCM_CCDR2_SGMII_PHY_CLK_OFFSET)
#define D4400_CCM_CCDR2_GEN_CLK_OFFSET	24
#define D4400_CCM_CCDR2_GEN_CLK_MASK	(7<<D4400_CCM_CCDR2_GEN_CLK_OFFSET)
#define D4400_CCM_CCDR2_TRACE_DIV_OFFSET	28
#define D4400_CCM_CCDR2_TRACE_DIV_MASK	(0xF<<D4400_CCM_CCDR2_TRACE_DIV_OFFSET)

/* CCM-CCDR3 */
#define D4400_CCM_CCDR3_ECSPI1_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI1_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI1_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI2_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI2_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI2_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI3_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI3_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI3_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI4_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI4_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI4_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI5_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI5_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI5_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI6_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI6_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI6_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI7_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI7_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI7_DIV_OFFSET)
#define D4400_CCM_CCDR3_ECSPI8_DIV_OFFSET	0
#define D4400_CCM_CCDR3_ECSPI8_DIV_MASK	(0xF<<D4400_CCM_CCDR3_ECSPI8_DIV_OFFSET)

/* CCM-SPLLGSR */
#define D4400_CCM_SPLLGSR_CFG_OFFSET	1
#define D4400_CCM_SPLLGSR_CFG_MASK	(0x3F<<D4400_CCM_SPLLGSR_CFG_OFFSET)
#define D4400_CCM_SPLLGSR_KILL_OFFSET	31
#define D4400_CCM_SPLLGSR_KILL_MASK	(1<<D4400_CCM_SPLLGSR_KILL_OFFSET)

/* CCM-DPLLGSR */
#define D4400_CCM_DPLLGSR_CFG_OFFSET	1
#define D4400_CCM_DPLLGSR_CFG_MASK	(0x3F<<D4400_CCM_SPLLGSR_CFG_OFFSET)
#define D4400_CCM_DPLLGSR_KILL_OFFSET	31
#define D4400_CCM_DPLLGSR_KILL_MASK	(1<<D4400_CCM_SPLLGSR_KILL_OFFSET)

/* CCM-TPLLGSR */
#define D4400_CCM_TPLLGSR_CFG_OFFSET	1
#define D4400_CCM_TPLLGSR_CFG_MASK	(0x3F<<D4400_CCM_TPLLGSR_CFG_OFFSET)
#define D4400_CCM_TPLLGSR_KILL_OFFSET	31
#define D4400_CCM_TPLLGSR_KILL_MASK	(1<<D4400_CCM_TPLLGSR_KILL_OFFSET)

#define D4400_UART_6144_REF_CLK	61440000

#endif/*__ARCH_ARM_D4400_CCM_REGS_H__*/
